// map_data.js

const MAP_DATA = {
    easy: {
        imageSrc: 'img/map/easy.png',
        enemyPath: [
            [7, 3], [6, 3], [6, 4], [6, 5], [5, 5], [4, 5], [4, 4], [4, 3], 
            [4, 2], [5, 2], [5, 1], [5, 0], [4, 0], [3, 0], [2, 0], [2, 1], 
            [2, 2], [2, 3], [2, 4], [2, 5], [1, 5], [0, 5], [0, 4], [0, 3], 
            [0, 2], [0, 1], [0, 0]
        ],
        placementCells: [
            [1, 1], [1, 2], [1, 4], 
			[3, 2], [3, 4], [4, 1],
			[5, 4], [6, 2], [7, 4]
        ],
        obstacleCells: [] // Препятствия все остальное
    },
    normal: {
        imageSrc: 'img/map/normal.png',
        enemyPath: [
            // Путь для normal карты
            [7, 2], [6, 2], [6, 1], [5, 1], [4, 1], [4, 2], [4, 3], [4, 4],
            [4, 5], [3, 5], [2, 5], [1, 5], [1, 4], [1, 3], [1, 2], [2, 2], [2, 1],
            [2, 0], [1, 0], [0, 0]
        ],
        placementCells: [
            [0, 3], [1, 1], [2, 3], 
            [3, 1], [3, 2], [3, 4],
            [5, 0], [5, 2], [5, 3]
        ],
        obstacleCells: [

		]
    },
    hard: {
        imageSrc: 'img/map/hard.png',
        enemyPath: [
            // Путь для hard карты
            [7, 4], [6, 4], [6, 3], [6, 2], [6, 1], [5, 1], [4, 1], [4, 2],
            [3, 2], [3, 3], [3, 4], [2, 4], [1, 4], [1, 3], [1, 2], [0, 2]
        ],
        placementCells: [
            [0, 3], [2, 3], [2, 5], 
            [3, 1], [4, 3], [5, 0],
            [5, 2], [5, 3], [7, 3]
        ],
        obstacleCells: [
			[0, 0], [0, 1], [0, 4], [0, 5], [1, 0], [1, 1], [1, 5], [2, 0],
            [2, 1], [2, 2], [3, 0], [3, 5], [4, 0], [4, 4], [4, 5], [5, 4], [5, 5],
            [6, 0], [6, 5], [7, 0], [7, 1], [7, 2], [7, 5]
		]
    }
};

// Переменная для хранения выбранной карты
let selectedMapName = null;
let currentMapData = null;